# Дополнительное практическое задание по модулю: "Основные операторы"

# Добавил словарь верных паролей для проверки работы программы
verify_pass = {
    3: '12',
    4: '13',
    5: '1423',
    6: '121524',
    7: '162534',
    8: '13172635',
    9: '1218273645',
    10: '141923283746',
    11: '11029384756',
    12: '12131511124210394857',
    13: '112211310495867',
    14: '1611325212343114105968',
    15: '1214114232133124115106978',
    16: '1317115262143531341251161079',
    17: '11621531441351261171089',
    18: '12151811724272163631545414513612711810',
    19: '118217316415514613712811910',
    20: '13141911923282183731746416515614713812911',
}

first_num = int(input('Введите число от 3 до 20: '))
result = ''
if 3 <= first_num <= 20:

    # Решение задачи
    for i in range(1, first_num):
        for j in range(i+1, first_num):
            if first_num % (i + j) == 0:
                num = str(i) + str(j)
                result += num
    print(result)

    # Проверка результата
    if result == verify_pass[first_num]:
        print('Пароль верный')
    else:
        print('Пароль не верный')

else:
    print('Введённое число не входит в требуемый диапазон (3-20)')
